//[USER-ID]B JOB CLASS=A,MSGLEVEL=(1,1),MSGCLASS=Q, 
//  NOTIFY=&SYSUID,REGION=0M
//  JCLLIB ODER=[USER-ID].AD40.COBOL
//STEP1 EXEC PROC=IGYWCL,MEM=TRAIN
//SYSPRINT DD SYSOUT=*
//COBOL.SYSIN DD DSN=[USER-ID].AD40.COBOL(&MEM),DISP=SHR
//LKED.SYSLMOD DD DSN=[USER-ID].AD40.LOADLIB(&MEM),DISP=SHR
