//<TSO_ID>B JOB CLASS=A,MSGLEVEL=(1,1),MSGCLASS=Q,
//  NOTIFY=&SYSUID,REGION=0M
//JOBLIB DD DSN=<TSO_ID>.AD40.LOADLIB,DISP=SHR
//STEP1 EXEC PGM=TRAIN
//SYSPRINT DD SYSOUT=*
//COMPFILE DD DSN=<TSO_ID>.COMPARE.SEQFILE,DSP=SHR
//MASTFILE DD DSN=<TSO_ID>.VSAM.KSDS99,DISP=SHR
//RESFILE DD DSN=<TSO_ID>.RESULT.PS,DISP=SHR
/*
