//[USER-ID]B JOB CLASS=A,MSGLEVEL=(1,1),MSGCLASS=Q,
//  NOTIFY=&SYSUID,REGION=0M
//JOBLIB DD DSN=[USER-ID].AD40.LOADLIB,DISP=SHR
//STEP1 EXEC PGM=TRAIN
//SYSPRINT DD SYSOUT=*
//COMPFILE DD DSN=[USER-ID].COMPARE.SEQFILE,DSP=SHR
//MASTFILE DD DSN=[USER-ID].VSAM.KSDS99,DISP=SHR
//RESFILE DD DSN=[USER-ID].RESULT.PS,DISP=SHR
/*
